tutorial/cylinder2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (94 0 0);

boundaryField
{
    front
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (94 0 0);
    }
    back
    {
        type            empty;
    }
    top
    {
        type            zeroGradient;
    }
    cylinderfront
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottom
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    cylinderback
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
